000100 IDENTIFICATION DIVISION.
000110 PROGRAM-ID. PRAC14.
000120 AUTHOR. LUIS CECILIANO.
000130 DATE-WRITTEN. DECEMBER 18, 2019.
000140*ESTE PROGRAMA CARGA VALORES EN RAM EN UNA BASE DE DATOS
000150 SECURITY. FOREVER.
000200 ENVIRONMENT DIVISION.
000300 DATA DIVISION.
       DATA-BASE SECTION.
           DB BD01CURSOS VALUE OF TITLE IS
             "BD01CURSOS ON CREDITO".
       WORKING-STORAGE SECTION.
           01 WKS-EOF-LISTA PIC 9(02) VA 0.
           01 WKS-INDICE    PIC 9(02).
           01 WKS-LISTA-CURSOS.
               02 FILLER PIC X(11) VA "0502CANDE03".
               02 FILLER PIC X(11) VA "0202COBOL06".
               02 FILLER PIC X(11) VA "0604DMSII02".
               02 FILLER PIC X(11) VA "0404DASDL03".
               02 FILLER PIC X(11) VA "0301ALGOL21".
           01 WKS-LISTA-CURSO REDEFINES WKS-LISTA-CURSOS.
               02 WKS-CURSO OCCURS 5 TIMES.
                   03 WKS-CVE-CURSO       PIC 9(04).
                   03 WKS-DESCRIPCION     PIC X(05).
                   03 WKS-HORAS-DEDICADAS PIC 9(02).
       PROCEDURE DIVISION.
       0000-PRINCIPAL.
           PERFORM 1000-INICIO
           PERFORM 2000-PROCESO
           PERFORM 3000-TERMINA
           STOP RUN.
       1000-INICIO.
           OPEN UPDATE BD01CURSOS.
       2000-PROCESO.
           PERFORM 999-DMS-BEGIN-TRANSACTION
           PERFORM 2500-ACTUALIZA-BD02 VARYING WKS-INDICE FROM 1 BY 1
                                               UNTIL WKS-INDICE > 5
           PERFORM 999-DMS-END-TRANSACTION.
       2500-ACTUALIZA-BD02.
           PERFORM 2600-CREA-BD02
           PERFORM 2700-MUEVE-DATOS
           PERFORM 2800-GRABA-BD02.
       2600-CREA-BD02.
           CREATE BD02CURSOS.
       2700-MUEVE-DATOS.
           MOVE WKS-CVE-CURSO       (WKS-INDICE) TO BD02-CVE-CURSO
           MOVE WKS-DESCRIPCION     (WKS-INDICE) TO BD02-DESCRIP
           MOVE WKS-HORAS-DEDICADAS (WKS-INDICE) TO BD02-HORAS-ASIG.
       2800-GRABA-BD02.
           STORE BD02CURSOS
             ON EXCEPTION 
               DISPLAY "REGISTRO YA EXISTENTE.".
       3000-TERMINA.
           CLOSE BD01CURSOS.
       999-DMS-BEGIN-TRANSACTION.
           BEGIN-TRANSACTION NO-AUDIT BDS90-RESTART.
       999-DMS-END-TRANSACTION.
           END-TRANSACTION AUDIT BDS90-RESTART.
