000100 IDENTIFICATION DIVISION.
000110 PROGRAM-ID. PRAC07.
000120 AUTHOR. LUIS CECILIANO.
000130 DATE-WRITTEN. NOVEMBER 4, 2019.
000140*ESTE PROGRAMA UTILIZA LAS INSTRUCCIONES DE MULTIPLICACION Y SUMA
000150 SECURITY. FOREVER.
000200 ENVIRONMENT DIVISION.
000300 DATA DIVISION.
000310 WORKING-STORAGE SECTION.
000320    01 WKS-A    PIC 9(06)V9(06).
000330    01 WKS-B    PIC 9(06)V9(06).
000340    01 WKS-C    PIC 9(06)V9(06).
000350    01 WKS-D    PIC S9(06)V9(06).
000400 PROCEDURE DIVISION.
000500 0000-CONTROL.
000600    MOVE 118 TO WKS-A
000700    MOVE 117 TO WKS-B 
000800    MOVE 1   TO WKS-C
000900    MULTIPLY WKS-B BY WKS-A
001000    ADD WKS-C WKS-B GIVING WKS-D
001100    DISPLAY WKS-D
001200    STOP RUN.