000100 IDENTIFICATION DIVISION.
000110 PROGRAM-ID. PRAC08.
000120 AUTHOR. LUIS CECILIANO.
000130 DATE-WRITTEN. NOVEMBER 4, 2019.
000140*ESTE PROGRAMA UTILIZA LAS INSTRUCCIONES DISPLAY Y ACCEPT
000150 SECURITY. FOREVER.
000200 ENVIRONMENT DIVISION.
000300 DATA DIVISION.
000310 WORKING-STORAGE SECTION.
000320     01 WKS-EDAD    PIC 9(03).
000330     01 WKS-NOMBRE  PIC X(36).
000400 PROCEDURE DIVISION.
000500 0000-CONTROL.
000600     DISPLAY "INTRODUCE TU NOMBRE:"
000700     ACCEPT WKS-NOMBRE
000800     DISPLAY "ESCRIBISTE QUE TU NOMBRE ES:" WKS-NOMBRE
000900     DISPLAY "INTRODUCE TU EDAD:"
001000     ACCEPT WKS-EDAD
001100     DISPLAY "ESCRIBISTE QUE TU EDAD ES:" WKS-EDAD
001200     STOP RUN.